erpdev.СХК_Расширение/src/DataProcessors/МобильныйСкладТест/МобильныйСкладТест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МобильныйСкладТест</name>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="08a6fc5b-ac14-420f-987d-169c39288bf4">
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b4c013e1-f51f-4900-840f-f755e500fa76">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07d94e4d-722d-4939-a3da-ba2a3afba256">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="145a504e-53c5-4349-a710-b106ea052174">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89cd1a11-c961-49a0-b7ea-67cc67387e68">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63f1d0df-8450-40b2-a6bf-26e9a9bc348d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00a21d2c-dfa9-40aa-938f-3fe890533f41">
    <name>ПорядокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="96ee5655-e55c-4d9d-9386-a82e47bcd733">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fb4b5c4-30c2-4b89-82ff-7057477218df">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e82bc85-5efe-473f-a2a6-04b053896ef5">
    <name>ЗонаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6a9f8399-4614-4cb5-ba80-210c90c11e54">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49f3e5fd-cf9c-4585-8222-c47ae930e2dd">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d8985e0-1a5e-4908-ba86-c4b692cd1634">
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47e1733e-b075-4282-944c-d07d96cd86a9">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8ee7ff7a-ec43-4840-800d-22245c14dc90">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="07df2cb8-3a48-4671-b17f-d2bf82e412f8">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83f29f84-a577-47ce-933a-46184309914f">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СХК_НомерПалета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="83b872e0-168f-4cbc-b791-68c2edf79de4">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cd7cf0b2-0078-4dfa-b137-5418e69d7024">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8e2e117e-50d4-46cf-9e08-ea6f475d1cca">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae04c7e3-73f4-4a07-bef6-baf69fcb4dfc">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0185ac19-4e81-475e-842b-4f1cec88f0d3">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="323f8573-378e-4fef-931a-b93c2c113890">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c4e6782d-54b8-4614-8549-b94f2af33d1b">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8666ee78-482b-4c09-9baa-791917648dbd">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9cf586a-fbd5-4e5f-a0f7-df3ef40e11d2">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc35a8ee-3531-4b7e-8222-611bb0bc88ab">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40dd6af6-2e66-4e56-b31e-687455807ff2">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/DataProcessors/МобильныйСкладТест/Forms/СписокОрдеров/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.ПериодДата = ТекущаяДата(); 
	//ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ПериодДата;
	//ЭтаФорма.НачатьРедактированиеЭлемента();
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала",НачалоДня(ЭтотОбъект.ПериодДата));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",КонецДня(ЭтотОбъект.ПериодДата));
	АктивироватьПоиск();
КонецПроцедуры

&НаКлиенте
Процедура QRОрдераИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Рез = ПоискОрдерПриИзмененииНаСервере(Текст);
	Если Рез <> Ложь Тогда
		ПараметрыФормыЗаказа = Новый Структура;
		ПараметрыФормыЗаказа.Вставить("Ссылка",Рез);
		//Теперь помещаем эти данные в хранилище и получаем адрес этого хранилища
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыЗаказа,Новый УникальныйИдентификатор);
		//Создаем структуру с параметрами, которые передадим во вторую форму
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
		ОткрытьФорму("Обработка.МобильныйСкладТест.Форма.Ордер", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
	Иначе
		Сообщить("Не нашел");
	КонецЕсли;
	
КонецПроцедуры  


&НаСервере
Функция ПоискОрдерПриИзмененииНаСервере(Номер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И РасходныйОрдерНаТовары.Номер = &Номер";
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ЭтотОбъект.ПериодДата)-30*86400);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ЭтотОбъект.ПериодДата)+10*86400);
	Запрос.УстановитьПараметр("Номер", Номер);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Количество()=1 Тогда
		Пока Рез.Следующий() Цикл
			Ссылка = Рез.Ссылка;
			Прервать;
		КонецЦикла;
	Иначе
		Ссылка = Ложь;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	
	Рез = ПоискОрдерПриИзмененииНаСервере(Элемент.ТекущиеДанные.Номер);
	Если Рез <> Ложь Тогда
		ПараметрыФормыЗаказа = Новый Структура;
		ПараметрыФормыЗаказа.Вставить("Ссылка",Рез);
		//Теперь помещаем эти данные в хранилище и получаем адрес этого хранилища
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыЗаказа,Новый УникальныйИдентификатор);
		//Создаем структуру с параметрами, которые передадим во вторую форму
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
		ОткрытьФорму("Обработка.МобильныйСкладТест.Форма.Ордер", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);
	Иначе
		Сообщить("Не нашел");
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
	ЭтаФорма.ОбновитьОтображениеДанных();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.QRОрдера.РедактированиеТекста = Истина;
	АктивироватьПоиск();
	ПодключитьОбработчикОжидания("АктивироватьПоиск",5,Истина);
КонецПроцедуры  




&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.QRОрдера.ОбновитьТекстРедактирования();
	Элементы.QRОрдера.Видимость = Ложь;
	Элементы.QRОрдера.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.QRОрдера; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
	ЗаполнитьСписок();
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	QRОрдера = "";
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок()
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала",НачалоДня(ЭтотОбъект.ПериодДата-30*86400));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",КонецДня(ЭтотОбъект.ПериодДата));
	Список.Параметры.УстановитьЗначениеПараметра("Склад",Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции")); 

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()

	ЭтаФорма.Элементы.QRОрдера.РедактированиеТекста = Истина;
	АктивироватьПоиск();

КонецПроцедуры
